; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-4-31)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-6 - location
	p0-7 - location
	p1-6 - location
	p2-3 - location
	p2-4 - location
	p3-8 - location
	p4-0 - location
	p4-5 - location
	p5-6 - location
	p7-1 - location
	p7-5 - location
	p8-1 - location
	p8-4 - location
	p8-5 - location
	)
	(:init
	(at driver1 s8)
	(at driver2 s3)
	(at driver3 s1)
	(at driver4 s3)
	(at driver5 s1)
	(at truck1 s7)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at package1 s5)
	(at package2 s2)
	(at package3 s3)
	(at package4 s2)
	(at package5 s7)
	(at package6 s7)
	(at package7 s4)
	(at package8 s5)
	(at package9 s1)
	(at package10 s6)
	(at package11 s0)
	(at package12 s5)
	(at package13 s8)
	(at package14 s0)
	(at package15 s8)
	(at package16 s4)
	(at package17 s7)
	(at package18 s7)
	(at package19 s8)
	(at package20 s5)
	(at package21 s1)
	(at package22 s5)
	(at package23 s8)
	(at package24 s5)
	(at package25 s5)
	(at package26 s3)
	(at package27 s1)
	(at package28 s6)
	(at package29 s5)
	(at package30 s5)
	(at package31 s5)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s8 p8-4)
	(path p8-4 s8)
	(path s4 p8-4)
	(path p8-4 s4)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(link s0 s1)
	(link s1 s0)
	(link s0 s4)
	(link s4 s0)
	(link s0 s5)
	(link s5 s0)
	(link s0 s6)
	(link s6 s0)
	(link s1 s4)
	(link s4 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s1)
	(link s1 s2)
	(link s2 s3)
	(link s3 s2)
	(link s2 s4)
	(link s4 s2)
	(link s2 s8)
	(link s8 s2)
	(link s4 s3)
	(link s3 s4)
	(link s4 s6)
	(link s6 s4)
	(link s4 s7)
	(link s7 s4)
	(link s5 s8)
	(link s8 s5)
	(link s6 s2)
	(link s2 s6)
	(link s6 s5)
	(link s5 s6)
	(link s7 s0)
	(link s0 s7)
	(link s7 s2)
	(link s2 s7)
	(link s7 s5)
	(link s5 s7)
	(link s8 s0)
	(link s0 s8)
	(link s8 s1)
	(link s1 s8)
	(link s8 s3)
	(link s3 s8)
	(link s8 s4)
	(link s4 s8)
)
	(:goal (and
	(at driver2 s6)
	(at driver3 s6)
	(at driver5 s6)
	(at truck2 s0)
	(at truck3 s5)
	(at truck4 s7)
	(at package1 s8)
	(at package2 s7)
	(at package3 s2)
	(at package4 s3)
	(at package5 s7)
	(at package6 s0)
	(at package7 s7)
	(at package8 s1)
	(at package9 s2)
	(at package10 s7)
	(at package11 s4)
	(at package12 s6)
	(at package13 s1)
	(at package14 s3)
	(at package15 s2)
	(at package16 s1)
	(at package17 s5)
	(at package18 s2)
	(at package19 s3)
	(at package20 s1)
	(at package21 s1)
	(at package22 s6)
	(at package23 s6)
	(at package24 s7)
	(at package25 s6)
	(at package26 s2)
	(at package27 s0)
	(at package28 s7)
	(at package29 s7)
	(at package30 s3)
	(at package31 s4)
	))


)

; plan
1. (walk driver1 s8 p8-4)
   deleted: (at driver1 s8)
   added: (at driver1 p8-4)
   goals met: 2 of 37
2. (walk driver1 p8-4 s4)
   deleted: (at driver1 p8-4)
   added: (at driver1 s4)
   goals met: 2 of 37
3. (board-truck driver1 s4 truck4)
   deleted: (at driver1 s4) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 2 of 37
4. (drive-truck driver1 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 2 of 37
5. (drive-truck driver1 s0 s5 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s5)
   goals met: 2 of 37
6. (board-truck driver2 s3 truck2)
   deleted: (at driver2 s3) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 37
7. (drive-truck driver2 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 2 of 37
8. (drive-truck driver2 s2 s8 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s8)
   goals met: 2 of 37
9. (load-truck s8 package23 truck2)
   deleted: (at package23 s8)
   added: (in package23 truck2)
   goals met: 2 of 37
10. (drive-truck driver2 s8 s0 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s0)
   goals met: 3 of 37
11. (load-truck s0 package14 truck2)
   deleted: (at package14 s0)
   added: (in package14 truck2)
   goals met: 3 of 37
12. (drive-truck driver2 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 2 of 37
13. (load-truck s2 package4 truck2)
   deleted: (at package4 s2)
   added: (in package4 truck2)
   goals met: 2 of 37
14. (drive-truck driver2 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 2 of 37
15. (load-truck s4 package7 truck2)
   deleted: (at package7 s4)
   added: (in package7 truck2)
   goals met: 2 of 37
16. (load-truck s4 package16 truck2)
   deleted: (at package16 s4)
   added: (in package16 truck2)
   goals met: 2 of 37
17. (drive-truck driver2 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 2 of 37
18. (load-truck s2 package2 truck2)
   deleted: (at package2 s2)
   added: (in package2 truck2)
   goals met: 2 of 37
19. (load-truck s5 package8 truck4)
   deleted: (at package8 s5)
   added: (in package8 truck4)
   goals met: 2 of 37
20. (load-truck s5 package31 truck4)
   deleted: (at package31 s5)
   added: (in package31 truck4)
   goals met: 2 of 37
21. (load-truck s5 package30 truck4)
   deleted: (at package30 s5)
   added: (in package30 truck4)
   goals met: 2 of 37
22. (load-truck s5 package29 truck4)
   deleted: (at package29 s5)
   added: (in package29 truck4)
   goals met: 2 of 37
23. (load-truck s5 package25 truck4)
   deleted: (at package25 s5)
   added: (in package25 truck4)
   goals met: 2 of 37
24. (load-truck s5 package24 truck4)
   deleted: (at package24 s5)
   added: (in package24 truck4)
   goals met: 2 of 37
25. (drive-truck driver1 s5 s7 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s7)
   goals met: 3 of 37
26. (load-truck s7 package6 truck4)
   deleted: (at package6 s7)
   added: (in package6 truck4)
   goals met: 3 of 37
27. (unload-truck s7 package29 truck4)
   deleted: (in package29 truck4)
   added: (at package29 s7)
   goals met: 4 of 37
28. (drive-truck driver1 s7 s0 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s0)
   goals met: 3 of 37
29. (unload-truck s0 package6 truck4)
   deleted: (in package6 truck4)
   added: (at package6 s0)
   goals met: 4 of 37
30. (load-truck s0 package11 truck4)
   deleted: (at package11 s0)
   added: (in package11 truck4)
   goals met: 4 of 37
31. (drive-truck driver1 s0 s7 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s7)
   goals met: 5 of 37
32. (unload-truck s7 package24 truck4)
   deleted: (in package24 truck4)
   added: (at package24 s7)
   goals met: 6 of 37
33. (load-truck s7 package18 truck4)
   deleted: (at package18 s7)
   added: (in package18 truck4)
   goals met: 6 of 37
34. (load-truck s7 package17 truck4)
   deleted: (at package17 s7)
   added: (in package17 truck4)
   goals met: 6 of 37
35. (drive-truck driver1 s7 s5 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s5)
   goals met: 5 of 37
36. (drive-truck driver1 s5 s8 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s8)
   goals met: 5 of 37
37. (load-truck s8 package19 truck4)
   deleted: (at package19 s8)
   added: (in package19 truck4)
   goals met: 5 of 37
38. (load-truck s8 package15 truck4)
   deleted: (at package15 s8)
   added: (in package15 truck4)
   goals met: 5 of 37
39. (load-truck s8 package13 truck4)
   deleted: (at package13 s8)
   added: (in package13 truck4)
   goals met: 5 of 37
40. (walk driver3 s1 p1-6)
   deleted: (at driver3 s1)
   added: (at driver3 p1-6)
   goals met: 5 of 37
41. (walk driver3 p1-6 s6)
   deleted: (at driver3 p1-6)
   added: (at driver3 s6)
   goals met: 6 of 37
42. (walk driver5 s1 p1-6)
   deleted: (at driver5 s1)
   added: (at driver5 p1-6)
   goals met: 6 of 37
43. (walk driver5 p1-6 s6)
   deleted: (at driver5 p1-6)
   added: (at driver5 s6)
   goals met: 7 of 37
44. (drive-truck driver2 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 8 of 37
45. (drive-truck driver1 s8 s2 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s2)
   goals met: 8 of 37
46. (drive-truck driver2 s0 s5 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   goals met: 7 of 37
47. (load-truck s5 package22 truck2)
   deleted: (at package22 s5)
   added: (in package22 truck2)
   goals met: 7 of 37
48. (load-truck s5 package20 truck2)
   deleted: (at package20 s5)
   added: (in package20 truck2)
   goals met: 7 of 37
49. (drive-truck driver2 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 8 of 37
50. (unload-truck s2 package18 truck4)
   deleted: (in package18 truck4)
   added: (at package18 s2)
   goals met: 9 of 37
51. (drive-truck driver1 s2 s4 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s4)
   goals met: 9 of 37
52. (unload-truck s4 package31 truck4)
   deleted: (in package31 truck4)
   added: (at package31 s4)
   goals met: 10 of 37
53. (unload-truck s4 package11 truck4)
   deleted: (in package11 truck4)
   added: (at package11 s4)
   goals met: 11 of 37
54. (drive-truck driver1 s4 s2 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s2)
   goals met: 11 of 37
55. (unload-truck s2 package15 truck4)
   deleted: (in package15 truck4)
   added: (at package15 s2)
   goals met: 12 of 37
56. (drive-truck driver1 s2 s3 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s3)
   goals met: 12 of 37
57. (unload-truck s3 package30 truck4)
   deleted: (in package30 truck4)
   added: (at package30 s3)
   goals met: 13 of 37
58. (load-truck s3 package3 truck4)
   deleted: (at package3 s3)
   added: (in package3 truck4)
   goals met: 13 of 37
59. (drive-truck driver1 s3 s2 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   goals met: 13 of 37
60. (unload-truck s2 package3 truck4)
   deleted: (in package3 truck4)
   added: (at package3 s2)
   goals met: 14 of 37
61. (drive-truck driver1 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 14 of 37
62. (load-truck s1 package9 truck4)
   deleted: (at package9 s1)
   added: (in package9 truck4)
   goals met: 14 of 37
63. (drive-truck driver1 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 14 of 37
64. (unload-truck s2 package9 truck4)
   deleted: (in package9 truck4)
   added: (at package9 s2)
   goals met: 15 of 37
65. (drive-truck driver1 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 15 of 37
66. (unload-truck s1 package8 truck4)
   deleted: (in package8 truck4)
   added: (at package8 s1)
   goals met: 16 of 37
67. (drive-truck driver1 s1 s4 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s4)
   goals met: 16 of 37
68. (drive-truck driver1 s4 s6 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s6)
   goals met: 16 of 37
69. (drive-truck driver1 s6 s5 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s5)
   goals met: 16 of 37
70. (unload-truck s5 package17 truck4)
   deleted: (in package17 truck4)
   added: (at package17 s5)
   goals met: 17 of 37
71. (load-truck s5 package12 truck4)
   deleted: (at package12 s5)
   added: (in package12 truck4)
   goals met: 17 of 37
72. (drive-truck driver1 s5 s6 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s6)
   goals met: 17 of 37
73. (load-truck s6 package28 truck4)
   deleted: (at package28 s6)
   added: (in package28 truck4)
   goals met: 17 of 37
74. (unload-truck s6 package25 truck4)
   deleted: (in package25 truck4)
   added: (at package25 s6)
   goals met: 18 of 37
75. (drive-truck driver1 s6 s4 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s4)
   goals met: 18 of 37
76. (drive-truck driver1 s4 s3 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   goals met: 18 of 37
77. (load-truck s3 package26 truck4)
   deleted: (at package26 s3)
   added: (in package26 truck4)
   goals met: 18 of 37
78. (drive-truck driver1 s3 s2 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   goals met: 18 of 37
79. (unload-truck s2 package26 truck4)
   deleted: (in package26 truck4)
   added: (at package26 s2)
   goals met: 19 of 37
80. (drive-truck driver1 s2 s7 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s7)
   goals met: 20 of 37
81. (unload-truck s7 package28 truck4)
   deleted: (in package28 truck4)
   added: (at package28 s7)
   goals met: 21 of 37
82. (drive-truck driver1 s7 s4 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s4)
   goals met: 20 of 37
83. (drive-truck driver1 s4 s1 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   goals met: 20 of 37
84. (load-truck s1 package27 truck4)
   deleted: (at package27 s1)
   added: (in package27 truck4)
   goals met: 20 of 37
85. (drive-truck driver1 s1 s0 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   goals met: 20 of 37
86. (unload-truck s0 package27 truck4)
   deleted: (in package27 truck4)
   added: (at package27 s0)
   goals met: 21 of 37
87. (drive-truck driver1 s0 s5 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s5)
   goals met: 21 of 37
88. (load-truck s5 package1 truck4)
   deleted: (at package1 s5)
   added: (in package1 truck4)
   goals met: 21 of 37
89. (drive-truck driver1 s5 s8 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s8)
   goals met: 21 of 37
90. (unload-truck s8 package1 truck4)
   deleted: (in package1 truck4)
   added: (at package1 s8)
   goals met: 22 of 37
91. (drive-truck driver1 s8 s1 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   goals met: 22 of 37
92. (drive-truck driver1 s1 s4 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s4)
   goals met: 22 of 37
93. (drive-truck driver1 s4 s6 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s6)
   goals met: 22 of 37
94. (unload-truck s6 package12 truck4)
   deleted: (in package12 truck4)
   added: (at package12 s6)
   goals met: 23 of 37
95. (drive-truck driver1 s6 s4 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s4)
   goals met: 23 of 37
96. (drive-truck driver1 s4 s1 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   goals met: 23 of 37
97. (unload-truck s1 package13 truck4)
   deleted: (in package13 truck4)
   added: (at package13 s1)
   goals met: 24 of 37
98. (drive-truck driver1 s1 s4 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s4)
   goals met: 24 of 37
99. (drive-truck driver1 s4 s3 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   goals met: 24 of 37
100. (unload-truck s3 package19 truck4)
   deleted: (in package19 truck4)
   added: (at package19 s3)
   goals met: 25 of 37
101. (drive-truck driver1 s3 s4 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   goals met: 25 of 37
102. (drive-truck driver1 s4 s7 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s7)
   goals met: 26 of 37
103. (drive-truck driver2 s0 s6 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   goals met: 25 of 37
104. (unload-truck s6 package23 truck2)
   deleted: (in package23 truck2)
   added: (at package23 s6)
   goals met: 26 of 37
105. (unload-truck s6 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s6)
   goals met: 27 of 37
106. (load-truck s6 package10 truck2)
   deleted: (at package10 s6)
   added: (in package10 truck2)
   goals met: 27 of 37
107. (drive-truck driver2 s6 s0 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   goals met: 28 of 37
108. (drive-truck driver2 s0 s7 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s7)
   goals met: 27 of 37
109. (unload-truck s7 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s7)
   goals met: 28 of 37
110. (unload-truck s7 package2 truck2)
   deleted: (in package2 truck2)
   added: (at package2 s7)
   goals met: 29 of 37
111. (drive-truck driver2 s7 s0 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s0)
   goals met: 30 of 37
112. (drive-truck driver2 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 29 of 37
113. (unload-truck s1 package20 truck2)
   deleted: (in package20 truck2)
   added: (at package20 s1)
   goals met: 30 of 37
114. (drive-truck driver2 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 31 of 37
115. (drive-truck driver2 s0 s8 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s8)
   goals met: 30 of 37
116. (drive-truck driver2 s8 s3 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s3)
   goals met: 30 of 37
117. (unload-truck s3 package4 truck2)
   deleted: (in package4 truck2)
   added: (at package4 s3)
   goals met: 31 of 37
118. (drive-truck driver2 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 31 of 37
119. (drive-truck driver2 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 32 of 37
120. (drive-truck driver2 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 31 of 37
121. (unload-truck s1 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s1)
   goals met: 32 of 37
122. (drive-truck driver2 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 33 of 37
123. (drive-truck driver2 s0 s7 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s7)
   goals met: 32 of 37
124. (unload-truck s7 package10 truck2)
   deleted: (in package10 truck2)
   added: (at package10 s7)
   goals met: 33 of 37
125. (drive-truck driver2 s7 s0 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s0)
   goals met: 34 of 37
126. (disembark-truck driver2 s0 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 34 of 37
127. (board-truck driver2 s0 truck3)
   deleted: (at driver2 s0) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 34 of 37
128. (unload-truck s0 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s0)
   goals met: 34 of 37
129. (load-truck s0 package14 truck3)
   deleted: (at package14 s0)
   added: (in package14 truck3)
   goals met: 34 of 37
130. (drive-truck driver2 s0 s5 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   goals met: 35 of 37
131. (drive-truck driver2 s5 s8 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s8)
   goals met: 34 of 37
132. (drive-truck driver2 s8 s3 truck3)
   deleted: (at truck3 s8)
   added: (at truck3 s3)
   goals met: 34 of 37
133. (unload-truck s3 package14 truck3)
   deleted: (in package14 truck3)
   added: (at package14 s3)
   goals met: 35 of 37
134. (drive-truck driver2 s3 s4 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 35 of 37
135. (drive-truck driver2 s4 s6 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s6)
   goals met: 35 of 37
136. (drive-truck driver2 s6 s5 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   goals met: 36 of 37
137. (disembark-truck driver2 s5 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s5) (empty truck3)
   goals met: 36 of 37
138. (walk driver2 s5 p5-6)
   deleted: (at driver2 s5)
   added: (at driver2 p5-6)
   goals met: 36 of 37
139. (walk driver2 p5-6 s6)
   deleted: (at driver2 p5-6)
   added: (at driver2 s6)
   goals met: 37 of 37
